mixly/Mixly_Arduino/mixly_arduino/arduino-1.x.x/portable/packages/esp8266/hardware/esp8266/2.5.0/boards.txt
#
# Do not create pull-requests for this file only, CI will not accept them.
# You *must* edit/modify/run boards.txt.py to regenerate boards.txt.
# All modified files after running with option "--allgen" must be included in the pull-request.
#

menu.BoardModel=Model
menu.baud=Upload Speed
menu.xtal=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.eesz=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.ESPModule=Module
menu.dbg=Debug port
menu.lvl=Debug Level
menu.ip=lwIP Variant
menu.vt=VTables
menu.exception=Exceptions
menu.led=Builtin Led
menu.wipe=Erase Flash

##############################################################
esp8266.name=Arduino ESP8266 Generic 
esp8266.build.board=ESP8266_GENERIC
esp8266.upload.tool=esptool
esp8266.upload.maximum_data_size=81920
esp8266.upload.wait_for_upload_port=true
esp8266.upload.erase_cmd=
esp8266.serial.disableDTR=true
esp8266.serial.disableRTS=true
esp8266.build.mcu=esp8266
esp8266.build.core=esp8266
esp8266.build.variant=generic
esp8266.build.spiffs_pagesize=256
esp8266.build.debug_port=
esp8266.build.debug_level=
esp8266.menu.xtal.80=80 MHz
esp8266.menu.xtal.80.build.f_cpu=80000000L
esp8266.menu.xtal.160=160 MHz
esp8266.menu.xtal.160.build.f_cpu=160000000L
esp8266.menu.vt.flash=Flash
esp8266.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
esp8266.menu.vt.heap=Heap
esp8266.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
esp8266.menu.vt.iram=IRAM
esp8266.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
esp8266.menu.exception.disabled=Disabled
esp8266.menu.exception.disabled.build.exception_flags=-fno-exceptions
esp8266.menu.exception.disabled.build.stdcpp_lib=-lstdc++
esp8266.menu.exception.enabled=Enabled
esp8266.menu.exception.enabled.build.exception_flags=-fexceptions
esp8266.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
esp8266.upload.resetmethod=nodemcu
esp8266.build.flash_mode=dio
esp8266.build.flash_flags=-DFLASHMODE_DIO
esp8266.build.flash_freq=40
esp8266.menu.eesz.4M=4M (no SPIFFS)
esp8266.menu.eesz.4M.build.flash_size=4M
esp8266.menu.eesz.4M.build.flash_size_bytes=0x400000
esp8266.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
esp8266.menu.eesz.4M.build.spiffs_pagesize=256
esp8266.menu.eesz.4M.upload.maximum_size=1044464
esp8266.menu.eesz.4M.build.rfcal_addr=0x3FC000
esp8266.menu.eesz.4M1M=4M (1M SPIFFS)
esp8266.menu.eesz.4M1M.build.flash_size=4M
esp8266.menu.eesz.4M1M.build.flash_size_bytes=0x400000
esp8266.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
esp8266.menu.eesz.4M1M.build.spiffs_pagesize=256
esp8266.menu.eesz.4M1M.upload.maximum_size=1044464
esp8266.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
esp8266.menu.eesz.4M1M.build.spiffs_start=0x300000
esp8266.menu.eesz.4M1M.build.spiffs_end=0x3FB000
esp8266.menu.eesz.4M1M.build.spiffs_blocksize=8192
esp8266.menu.eesz.4M2M=4M (2M SPIFFS)
esp8266.menu.eesz.4M2M.build.flash_size=4M
esp8266.menu.eesz.4M2M.build.flash_size_bytes=0x400000
esp8266.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
esp8266.menu.eesz.4M2M.build.spiffs_pagesize=256
esp8266.menu.eesz.4M2M.upload.maximum_size=1044464
esp8266.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
esp8266.menu.eesz.4M2M.build.spiffs_start=0x200000
esp8266.menu.eesz.4M2M.build.spiffs_end=0x3FB000
esp8266.menu.eesz.4M2M.build.spiffs_blocksize=8192
esp8266.menu.eesz.4M3M=4M (3M SPIFFS)
esp8266.menu.eesz.4M3M.build.flash_size=4M
esp8266.menu.eesz.4M3M.build.flash_size_bytes=0x400000
esp8266.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
esp8266.menu.eesz.4M3M.build.spiffs_pagesize=256
esp8266.menu.eesz.4M3M.upload.maximum_size=1044464
esp8266.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
esp8266.menu.eesz.4M3M.build.spiffs_start=0x100000
esp8266.menu.eesz.4M3M.build.spiffs_end=0x3FB000
esp8266.menu.eesz.4M3M.build.spiffs_blocksize=8192
esp8266.menu.ip.lm2f=v2 Lower Memory
esp8266.menu.ip.lm2f.build.lwip_include=lwip2/include
esp8266.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
esp8266.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
esp8266.menu.ip.hb2f=v2 Higher Bandwidth
esp8266.menu.ip.hb2f.build.lwip_include=lwip2/include
esp8266.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
esp8266.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
esp8266.menu.ip.lm2n=v2 Lower Memory (no features)
esp8266.menu.ip.lm2n.build.lwip_include=lwip2/include
esp8266.menu.ip.lm2n.build.lwip_lib=-llwip2-536
esp8266.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
esp8266.menu.ip.hb2n=v2 Higher Bandwidth (no features)
esp8266.menu.ip.hb2n.build.lwip_include=lwip2/include
esp8266.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
esp8266.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
esp8266.menu.ip.lm6f=v2 IPv6 Lower Memory
esp8266.menu.ip.lm6f.build.lwip_include=lwip2/include
esp8266.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
esp8266.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
esp8266.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
esp8266.menu.ip.hb6f.build.lwip_include=lwip2/include
esp8266.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
esp8266.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
esp8266.menu.ip.hb1=v1.4 Higher Bandwidth
esp8266.menu.ip.hb1.build.lwip_lib=-llwip_gcc
esp8266.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
esp8266.menu.ip.src=v1.4 Compile from source
esp8266.menu.ip.src.build.lwip_lib=-llwip_src
esp8266.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
esp8266.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
esp8266.menu.dbg.Disabled=Disabled
esp8266.menu.dbg.Disabled.build.debug_port=
esp8266.menu.dbg.Serial=Serial
esp8266.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
esp8266.menu.dbg.Serial1=Serial1
esp8266.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
esp8266.menu.lvl.None____=None
esp8266.menu.lvl.None____.build.debug_level=
esp8266.menu.lvl.SSL=SSL
esp8266.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
esp8266.menu.lvl.TLS_MEM=TLS_MEM
esp8266.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
esp8266.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
esp8266.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
esp8266.menu.lvl.HTTP_SERVER=HTTP_SERVER
esp8266.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
esp8266.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
esp8266.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
esp8266.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
esp8266.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
esp8266.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
esp8266.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
esp8266.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
esp8266.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
esp8266.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
esp8266.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
esp8266.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
esp8266.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
esp8266.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
esp8266.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
esp8266.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
esp8266.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp8266.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp8266.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp8266.menu.lvl.CORE=CORE
esp8266.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
esp8266.menu.lvl.WIFI=WIFI
esp8266.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
esp8266.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
esp8266.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
esp8266.menu.lvl.UPDATER=UPDATER
esp8266.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
esp8266.menu.lvl.OTA=OTA
esp8266.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
esp8266.menu.lvl.OOM=OOM
esp8266.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
esp8266.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
esp8266.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
esp8266.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
esp8266.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
esp8266.menu.wipe.none=Only Sketch
esp8266.menu.wipe.none.upload.erase_cmd=
esp8266.menu.wipe.sdk=Sketch + WiFi Settings
esp8266.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
esp8266.menu.wipe.all=All Flash Contents
esp8266.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
esp8266.menu.baud.921600=921600
esp8266.menu.baud.921600.upload.speed=921600
esp8266.menu.baud.9600=9600
esp8266.menu.baud.9600.upload.speed=9600
esp8266.menu.baud.57600=57600
esp8266.menu.baud.57600.upload.speed=57600
esp8266.menu.baud.115200=115200
esp8266.menu.baud.115200.upload.speed=115200
esp8266.menu.baud.230400.linux=230400
esp8266.menu.baud.230400.macosx=230400
esp8266.menu.baud.230400.upload.speed=230400
esp8266.menu.baud.256000.windows=256000
esp8266.menu.baud.256000.upload.speed=256000
esp8266.menu.baud.460800.linux=460800
esp8266.menu.baud.460800.macosx=460800
esp8266.menu.baud.460800.upload.speed=460800
esp8266.menu.baud.512000.windows=512000
esp8266.menu.baud.512000.upload.speed=512000

